Import Liberaries

In [145]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

Load The Dataset

In [240]:
data1 = pd.read_csv("zomato_data.csv")

In [242]:
data1.head()

,online_order,book_table,rate,votes,rest_type,dish_liked,cuisines,approx_costfor_two_people,listed_intype,listed_incity
0,Yes,Yes,4.1/5,775,Casual Dining,"Pasta, Lunch Buffet, Masala Papad, Paneer Laja...","North Indian, Mughlai, Chinese",800,Buffet,Banashankari
1,Yes,No,4.1/5,787,Casual Dining,"Momos, Lunch Buffet, Chocolate Nirvana, Thai G...","Chinese, North Indian, Thai",800,Buffet,Banashankari
2,Yes,No,3.8/5,918,"Cafe, Casual Dining","Churros, Cannelloni, Minestrone Soup, Hot Choc...","Cafe, Mexican, Italian",800,Buffet,Banashankari
3,No,No,3.7/5,88,Quick Bites,Masala Dosa,"South Indian, North Indian",300,Buffet,Banashankari
4,No,No,3.8/5,166,Casual Dining,"Panipuri, Gol Gappe","North Indian, Rajasthani",600,Buffet,Banashankari

In [244]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51717 entries, 0 to 51716
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   online_order               51717 non-null  object
 1   book_table                 51717 non-null  object
 2   rate                       43942 non-null  object
 3   votes                      51717 non-null  int64
 4   rest_type                  51490 non-null  object
 5   dish_liked                 23639 non-null  object
 6   cuisines                   51672 non-null  object
 7   approx_costfor_two_people  51371 non-null  object
 8   listed_intype              51717 non-null  object
 9   listed_incity              51717 non-null  object
dtypes: int64(1), object(9)
memory usage: 3.9+ MB

In [246]:
data1.describe()

              votes
count  51717.000000
mean     283.697527
std      803.838853
min        0.000000
25%        7.000000
50%       41.000000
75%      198.000000
max    16832.000000

In [248]:
data1.shape

(51717, 10)

Checking The Missing Values

In [250]:
data1.isnull().sum()

online_order                     0
book_table                       0
rate                          7775
votes                            0
rest_type                      227
dish_liked                   28078
cuisines                        45
approx_costfor_two_people      346
listed_intype                    0
listed_incity                    0
dtype: int64

In [252]:
data1.head()

,online_order,book_table,rate,votes,rest_type,dish_liked,cuisines,approx_costfor_two_people,listed_intype,listed_incity
0,Yes,Yes,4.1/5,775,Casual Dining,"Pasta, Lunch Buffet, Masala Papad, Paneer Laja...","North Indian, Mughlai, Chinese",800,Buffet,Banashankari
1,Yes,No,4.1/5,787,Casual Dining,"Momos, Lunch Buffet, Chocolate Nirvana, Thai G...","Chinese, North Indian, Thai",800,Buffet,Banashankari
2,Yes,No,3.8/5,918,"Cafe, Casual Dining","Churros, Cannelloni, Minestrone Soup, Hot Choc...","Cafe, Mexican, Italian",800,Buffet,Banashankari
3,No,No,3.7/5,88,Quick Bites,Masala Dosa,"South Indian, North Indian",300,Buffet,Banashankari
4,No,No,3.8/5,166,Casual Dining,"Panipuri, Gol Gappe","North Indian, Rajasthani",600,Buffet,Banashankari

In [254]:
#Replacing '-' values with NaN
data1["rate"] = data1["rate"].replace("-", np.NAN)

In [256]:
data1["rate"]

0         4.1/5
1         4.1/5
2         3.8/5
3         3.7/5
4         3.8/5
          ...
51712    3.6 /5
51713       NaN
51714       NaN
51715    4.3 /5
51716    3.4 /5
Name: rate, Length: 51717, dtype: object

In [258]:
#Remove /5 and retain only the numeric value
data1["rate"] = data1["rate"].str.replace("/5", '')

In [260]:
data1["rate"]

0         4.1
1         4.1
2         3.8
3         3.7
4         3.8
         ...
51712    3.6
51713     NaN
51714     NaN
51715    4.3
51716    3.4
Name: rate, Length: 51717, dtype: object

In [262]:
#Converting  float using pd.to_numeric()
data1["rate"] = pd.to_numeric(data1["rate"], errors = "coerce")

In [264]:
data1["rate"] = data1["rate"].fillna(data1["rate"].median())

In [266]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51717 entries, 0 to 51716
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   online_order               51717 non-null  object
 1   book_table                 51717 non-null  object
 2   rate                       51717 non-null  float64
 3   votes                      51717 non-null  int64
 4   rest_type                  51490 non-null  object
 5   dish_liked                 23639 non-null  object
 6   cuisines                   51672 non-null  object
 7   approx_costfor_two_people  51371 non-null  object
 8   listed_intype              51717 non-null  object
 9   listed_incity              51717 non-null  object
dtypes: float64(1), int64(1), object(8)
memory usage: 3.9+ MB

In [268]:
data1.isnull().sum()

online_order                     0
book_table                       0
rate                             0
votes                            0
rest_type                      227
dish_liked                   28078
cuisines                        45
approx_costfor_two_people      346
listed_intype                    0
listed_incity                    0
dtype: int64

In [270]:
data1.describe()

               rate         votes
count  51717.000000  51717.000000
mean       3.700362    283.697527
std        0.395391    803.838853
min        1.800000      0.000000
25%        3.500000      7.000000
50%        3.700000     41.000000
75%        3.900000    198.000000
max        4.900000  16832.000000

In [274]:
#Removing commas from numeric strings 
data1["approx_costfor_two_people"] = data1["approx_costfor_two_people"].str.replace(',', '')

In [276]:
#Convert to numeric
data1["approx_costfor_two_people"] = pd.to_numeric(data1["approx_costfor_two_people"], errors = "coerce")

In [278]:
#Fill missing values using the median cost
data1["approx_costfor_two_people"] = data1["approx_costfor_two_people"].fillna(data1["approx_costfor_two_people"].median())

In [280]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51717 entries, 0 to 51716
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   online_order               51717 non-null  object
 1   book_table                 51717 non-null  object
 2   rate                       51717 non-null  float64
 3   votes                      51717 non-null  int64
 4   rest_type                  51490 non-null  object
 5   dish_liked                 23639 non-null  object
 6   cuisines                   51672 non-null  object
 7   approx_costfor_two_people  51717 non-null  float64
 8   listed_intype              51717 non-null  object
 9   listed_incity              51717 non-null  object
dtypes: float64(2), int64(1), object(7)
memory usage: 3.9+ MB

In [282]:
data1.isnull().sum()

online_order                     0
book_table                       0
rate                             0
votes                            0
rest_type                      227
dish_liked                   28078
cuisines                        45
approx_costfor_two_people        0
listed_intype                    0
listed_incity                    0
dtype: int64

In [284]:
data1.describe()

               rate         votes  approx_costfor_two_people
count  51717.000000  51717.000000               51717.000000
mean       3.700362    283.697527                 554.391689
std        0.395391    803.838853                 437.563723
min        1.800000      0.000000                  40.000000
25%        3.500000      7.000000                 300.000000
50%        3.700000     41.000000                 400.000000
75%        3.900000    198.000000                 650.000000
max        4.900000  16832.000000                6000.000000

In [286]:
data1["votes"] = data1["votes"].astype(str).str.replace(',', '').astype(int)

In [288]:
data1["votes"] = pd.to_numeric(data1["votes"], errors = "coerce")

In [290]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51717 entries, 0 to 51716
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   online_order               51717 non-null  object
 1   book_table                 51717 non-null  object
 2   rate                       51717 non-null  float64
 3   votes                      51717 non-null  int32
 4   rest_type                  51490 non-null  object
 5   dish_liked                 23639 non-null  object
 6   cuisines                   51672 non-null  object
 7   approx_costfor_two_people  51717 non-null  float64
 8   listed_intype              51717 non-null  object
 9   listed_incity              51717 non-null  object
dtypes: float64(2), int32(1), object(7)
memory usage: 3.7+ MB

In [292]:
data1.isnull().sum()

online_order                     0
book_table                       0
rate                             0
votes                            0
rest_type                      227
dish_liked                   28078
cuisines                        45
approx_costfor_two_people        0
listed_intype                    0
listed_incity                    0
dtype: int64

In [294]:
data1.describe()

               rate         votes  approx_costfor_two_people
count  51717.000000  51717.000000               51717.000000
mean       3.700362    283.697527                 554.391689
std        0.395391    803.838853                 437.563723
min        1.800000      0.000000                  40.000000
25%        3.500000      7.000000                 300.000000
50%        3.700000     41.000000                 400.000000
75%        3.900000    198.000000                 650.000000
max        4.900000  16832.000000                6000.000000

In [296]:
data1["dish_liked"] = data1["dish_liked"].fillna("Not Available")

In [298]:
data1["cuisines"] = data1["cuisines"].fillna("Other")

In [300]:
data1["rest_type"] = data1["rest_type"].fillna("Unknown")

In [304]:
data1["votes"] = data1["votes"].fillna(data1["votes"].median())

In [306]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51717 entries, 0 to 51716
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   online_order               51717 non-null  object
 1   book_table                 51717 non-null  object
 2   rate                       51717 non-null  float64
 3   votes                      51717 non-null  int32
 4   rest_type                  51717 non-null  object
 5   dish_liked                 51717 non-null  object
 6   cuisines                   51717 non-null  object
 7   approx_costfor_two_people  51717 non-null  float64
 8   listed_intype              51717 non-null  object
 9   listed_incity              51717 non-null  object
dtypes: float64(2), int32(1), object(7)
memory usage: 3.7+ MB

In [308]:
data1.isnull().sum()

online_order                 0
book_table                   0
rate                         0
votes                        0
rest_type                    0
dish_liked                   0
cuisines                     0
approx_costfor_two_people    0
listed_intype                0
listed_incity                0
dtype: int64

In [310]:
data1.describe()

               rate         votes  approx_costfor_two_people
count  51717.000000  51717.000000               51717.000000
mean       3.700362    283.697527                 554.391689
std        0.395391    803.838853                 437.563723
min        1.800000      0.000000                  40.000000
25%        3.500000      7.000000                 300.000000
50%        3.700000     41.000000                 400.000000
75%        3.900000    198.000000                 650.000000
max        4.900000  16832.000000                6000.000000

In [312]:
binary = {"Yes" : 1, "No" : 0}

In [314]:
data1["online_order"] = data1["online_order"].map(binary)

In [316]:
data1["book_table"] = data1["book_table"].map(binary)

In [318]:
data1["rate"] = data1["rate"].astype(float)

In [320]:
data1["votes"] = data1["votes"].astype(int)

In [322]:
data1["approx_costfor_two_people"] = data1["approx_costfor_two_people"].astype(int)

In [324]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51717 entries, 0 to 51716
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   online_order               51717 non-null  int64
 1   book_table                 51717 non-null  int64
 2   rate                       51717 non-null  float64
 3   votes                      51717 non-null  int32
 4   rest_type                  51717 non-null  object
 5   dish_liked                 51717 non-null  object
 6   cuisines                   51717 non-null  object
 7   approx_costfor_two_people  51717 non-null  int32
 8   listed_intype              51717 non-null  object
 9   listed_incity              51717 non-null  object
dtypes: float64(1), int32(2), int64(2), object(5)
memory usage: 3.6+ MB

In [326]:
data1.isnull().sum()

online_order                 0
book_table                   0
rate                         0
votes                        0
rest_type                    0
dish_liked                   0
cuisines                     0
approx_costfor_two_people    0
listed_intype                0
listed_incity                0
dtype: int64

In [328]:
data1.describe()

,online_order,book_table,rate,votes,approx_costfor_two_people
count,51717.000000,51717.000000,51717.000000,51717.000000,51717.000000
mean,0.588665,0.124698,3.700362,283.697527,554.391689
std,0.492080,0.330379,0.395391,803.838853,437.563723
min,0.000000,0.000000,1.800000,0.000000,40.000000
25%,0.000000,0.000000,3.500000,7.000000,300.000000
50%,1.000000,0.000000,3.700000,41.000000,400.000000
75%,1.000000,0.000000,3.900000,198.000000,650.000000
max,1.000000,1.000000,4.900000,16832.000000,6000.000000

In [330]:
data2 = pd.read_csv("Geographical Coordinates.csv")

In [332]:
data2.head()

       listed_incity   Latitude  Longitude
0       Banashankari  12.939333  77.553982
1  Bannerghatta Road  12.952660  77.605048
2       Basavanagudi  12.941726  77.575502
3          Bellandur  12.925352  77.675941
4       Brigade Road  12.967358  77.606435

In [334]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   listed_incity  26 non-null     object
 1   Latitude       26 non-null     float64
 2   Longitude      26 non-null     float64
dtypes: float64(2), object(1)
memory usage: 756.0+ bytes

In [336]:
data2.shape

(26, 3)

In [338]:
data2.describe()

        Latitude  Longitude
count  26.000000  26.000000
mean   12.956047  77.616160
std     0.041534   0.041982
min    12.848760  77.545278
25%    12.935253  77.589082
50%    12.953958  77.610134
75%    12.975373  77.639803
max    13.039186  77.722437

In [340]:
data2.isnull().sum()

listed_incity    0
Latitude         0
Longitude        0
dtype: int64

In [650]:
!pip install folium

Collecting folium
  Downloading folium-0.19.5-py2.py3-none-any.whl.metadata (4.1 kB)
Collecting branca>=0.6.0 (from folium)
  Downloading branca-0.8.1-py3-none-any.whl.metadata (1.5 kB)
Requirement already satisfied: jinja2>=2.9 in c:\users\admin\anaconda3\lib\site-packages (from folium) (3.1.4)
Requirement already satisfied: numpy in c:\users\admin\anaconda3\lib\site-packages (from folium) (1.26.4)
Requirement already satisfied: requests in c:\users\admin\anaconda3\lib\site-packages (from folium) (2.32.2)
Requirement already satisfied: xyzservices in c:\users\admin\anaconda3\lib\site-packages (from folium) (2022.9.0)
Requirement already satisfied: MarkupSafe>=2.0 in c:\users\admin\anaconda3\lib\site-packages (from jinja2>=2.9->folium) (2.1.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\admin\anaconda3\lib\site-packages (from requests->folium) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in c:\users\admin\anaconda3\lib\site-packages (from requests->folium) (3.7)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\admin\anaconda3\lib\site-packages (from requests->folium) (2.2.2)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\admin\anaconda3\lib\site-packages (from requests->folium) (2024.7.4)
Downloading folium-0.19.5-py2.py3-none-any.whl (110 kB)
   ---------------------------------------- 0.0/110.9 kB ? eta -:--:--
   ---------------------------------------- 110.9/110.9 kB 3.2 MB/s eta 0:00:00
Downloading branca-0.8.1-py3-none-any.whl (26 kB)
Installing collected packages: branca, folium
Successfully installed branca-0.8.1 folium-0.19.5

In [652]:
!pip  install IPython

Requirement already satisfied: IPython in c:\users\admin\anaconda3\lib\site-packages (8.25.0)
Requirement already satisfied: decorator in c:\users\admin\anaconda3\lib\site-packages (from IPython) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\admin\anaconda3\lib\site-packages (from IPython) (0.18.1)
Requirement already satisfied: matplotlib-inline in c:\users\admin\anaconda3\lib\site-packages (from IPython) (0.1.6)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\admin\anaconda3\lib\site-packages (from IPython) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in c:\users\admin\anaconda3\lib\site-packages (from IPython) (2.15.1)
Requirement already satisfied: stack-data in c:\users\admin\anaconda3\lib\site-packages (from IPython) (0.2.0)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\admin\anaconda3\lib\site-packages (from IPython) (5.14.3)
Requirement already satisfied: colorama in c:\users\admin\anaconda3\lib\site-packages (from IPython) (0.4.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\admin\anaconda3\lib\site-packages (from jedi>=0.16->IPython) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\admin\anaconda3\lib\site-packages (from prompt-toolkit<3.1.0,>=3.0.41->IPython) (0.2.5)
Requirement already satisfied: executing in c:\users\admin\anaconda3\lib\site-packages (from stack-data->IPython) (0.8.3)
Requirement already satisfied: asttokens in c:\users\admin\anaconda3\lib\site-packages (from stack-data->IPython) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\admin\anaconda3\lib\site-packages (from stack-data->IPython) (0.2.2)
Requirement already satisfied: six in c:\users\admin\anaconda3\lib\site-packages (from asttokens->stack-data->IPython) (1.16.0)

In [746]:
!pip install geopy

Collecting geopy
  Downloading geopy-2.4.1-py3-none-any.whl.metadata (6.8 kB)
Collecting geographiclib<3,>=1.52 (from geopy)
  Downloading geographiclib-2.0-py3-none-any.whl.metadata (1.4 kB)
Downloading geopy-2.4.1-py3-none-any.whl (125 kB)
   ---------------------------------------- 0.0/125.4 kB ? eta -:--:--
   ---------------------------------------  122.9/125.4 kB 7.0 MB/s eta 0:00:01
   ---------------------------------------- 125.4/125.4 kB 2.5 MB/s eta 0:00:00
Downloading geographiclib-2.0-py3-none-any.whl (40 kB)
   ---------------------------------------- 0.0/40.3 kB ? eta -:--:--
   ---------------------------------------- 40.3/40.3 kB 970.5 kB/s eta 0:00:00
Installing collected packages: geographiclib, geopy
Successfully installed geographiclib-2.0 geopy-2.4.1

In [342]:
from IPython.display import display, HTML
from folium.plugins import MarkerCluster
from geopy.geocoders import Nominatim
from geopy.exc import GeocoderTimedOut
import time
import folium
from IPython.display import IFrame

In [344]:
merge_df = pd.merge(data1, data2, how = "left", on = "listed_incity")

In [346]:
merge_df.head()

,online_order,book_table,rate,votes,rest_type,dish_liked,cuisines,approx_costfor_two_people,listed_intype,listed_incity,Latitude,Longitude
0,1,1,4.1,775,Casual Dining,"Pasta, Lunch Buffet, Masala Papad, Paneer Laja...","North Indian, Mughlai, Chinese",800,Buffet,Banashankari,12.939333,77.553982
1,1,0,4.1,787,Casual Dining,"Momos, Lunch Buffet, Chocolate Nirvana, Thai G...","Chinese, North Indian, Thai",800,Buffet,Banashankari,12.939333,77.553982
2,1,0,3.8,918,"Cafe, Casual Dining","Churros, Cannelloni, Minestrone Soup, Hot Choc...","Cafe, Mexican, Italian",800,Buffet,Banashankari,12.939333,77.553982
3,0,0,3.7,88,Quick Bites,Masala Dosa,"South Indian, North Indian",300,Buffet,Banashankari,12.939333,77.553982
4,0,0,3.8,166,Casual Dining,"Panipuri, Gol Gappe","North Indian, Rajasthani",600,Buffet,Banashankari,12.939333,77.553982

In [348]:
italian_df = merge_df[merge_df["cuisines"].str.contains("Italian", na = False)]
italian_df = italian_df.dropna(subset = ["Latitude", "Longitude"])
map = folium.Map(location = [12.9716, 77.5946], zoom_start = 12)
for i, row in italian_df.iterrows():
    folium.Marker(
        location = [row["Latitude"], row["Longitude"]],
        popup = f"{row["listed_incity"]} <br> Cuisines: {row["cuisines"]}",
        icon = folium.Icon(color = "purple")
    ).add_to(map)
map.save("italian_spots_map.html")

In [350]:
IFrame("italian_spots_map.html", width = 1000, height = 800)

In [358]:
ccuisin = df[df["cuisines"].str.contains("North Indian")]["cuisines"].count()

In [360]:
ccuisin

21085

In [391]:
cuisine = df["cuisines"].value_counts().idxmax()

In [393]:
cuisine

'North Indian'

In [411]:
avg = df.groupby("listed_incity")["approx_costfor_two_people"].mean().idxmax()

In [413]:
avg

'Church Street'

In [419]:
votes = df[df["votes"] > 1000]

In [429]:
rate = votes.groupby("rest_type")["rate"].mean().idxmax()

In [431]:
rate

'Bakery'

In [499]:
vote = df[(df["votes"] > 500) & (df["rate"] < 3.0)]["listed_incity"].value_counts().idxmax()

In [501]:
vote

'Brookefield'

In [529]:
diversity = df.groupby("listed_incity")["rest_type"].nunique().idxmax()

In [531]:
diversity

'BTM'

In [544]:
online_order = df[df["online_order"] == 1]["votes"].max()

In [546]:
online_order

16832

In [552]:
couisin = df[df["cuisines"].str.contains("North Indian") & df["cuisines"].str.contains(" Chinese")]["rate"].mean()

In [554]:
couisin

3.5913993174061436

In [642]:
count = df[(df["rate"] > 4.2) & (df["votes"] > 500) & (df["online_order"] == 1)]["listed_incity"].value_counts().idxmax()

In [644]:
counts

'Koramangala 7th Block'